zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/rtc.h
/**
 * \brief Component description for PIC32CZ/CA70 RTC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_RTC_COMPONENT_H_
#define _PIC32CZ_CA70_RTC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_RTC Real-time Clock
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR RTC */
/* ========================================================================== */

/* -------- RTC_CR : (RTC Offset: 0x00) (R/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t UPDTIM:1;                  /**< bit:      0  Update Request Time Register                  */
    uint32_t UPDCAL:1;                  /**< bit:      1  Update Request Calendar Register              */
    uint32_t :6;                        /**< bit:   2..7  Reserved                                      */
    uint32_t TIMEVSEL:2;                /**< bit:   8..9  Time Event Selection                          */
    uint32_t :6;                        /**< bit: 10..15  Reserved                                      */
    uint32_t CALEVSEL:2;                /**< bit: 16..17  Calendar Event Selection                      */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __RTC_CR_bits_t;

#define RTC_CR_UPDTIM_Pos                     (0)                                            /**< (RTC_CR) Update Request Time Register Position */
#define RTC_CR_UPDTIM_Msk                     (0x1U << RTC_CR_UPDTIM_Pos)                    /**< (RTC_CR) Update Request Time Register Mask */
#define RTC_CR_UPDCAL_Pos                     (1)                                            /**< (RTC_CR) Update Request Calendar Register Position */
#define RTC_CR_UPDCAL_Msk                     (0x1U << RTC_CR_UPDCAL_Pos)                    /**< (RTC_CR) Update Request Calendar Register Mask */
#define RTC_CR_TIMEVSEL_Pos                   (8)                                            /**< (RTC_CR) Time Event Selection Position */
#define RTC_CR_TIMEVSEL_Msk                   (0x3U << RTC_CR_TIMEVSEL_Pos)                  /**< (RTC_CR) Time Event Selection Mask */
#define RTC_CR_TIMEVSEL(value)                (RTC_CR_TIMEVSEL_Msk & ((value) << RTC_CR_TIMEVSEL_Pos))
#define   RTC_CR_TIMEVSEL_MINUTE_Val          (0x0U)                                         /**< (RTC_CR) Minute change  */
#define   RTC_CR_TIMEVSEL_HOUR_Val            (0x1U)                                         /**< (RTC_CR) Hour change  */
#define   RTC_CR_TIMEVSEL_MIDNIGHT_Val        (0x2U)                                         /**< (RTC_CR) Every day at midnight  */
#define   RTC_CR_TIMEVSEL_NOON_Val            (0x3U)                                         /**< (RTC_CR) Every day at noon  */
#define RTC_CR_TIMEVSEL_MINUTE                (RTC_CR_TIMEVSEL_MINUTE_Val << RTC_CR_TIMEVSEL_Pos)  /**< (RTC_CR) Minute change Position  */
#define RTC_CR_TIMEVSEL_HOUR                  (RTC_CR_TIMEVSEL_HOUR_Val << RTC_CR_TIMEVSEL_Pos)  /**< (RTC_CR) Hour change Position  */
#define RTC_CR_TIMEVSEL_MIDNIGHT              (RTC_CR_TIMEVSEL_MIDNIGHT_Val << RTC_CR_TIMEVSEL_Pos)  /**< (RTC_CR) Every day at midnight Position  */
#define RTC_CR_TIMEVSEL_NOON                  (RTC_CR_TIMEVSEL_NOON_Val << RTC_CR_TIMEVSEL_Pos)  /**< (RTC_CR) Every day at noon Position  */
#define RTC_CR_CALEVSEL_Pos                   (16)                                           /**< (RTC_CR) Calendar Event Selection Position */
#define RTC_CR_CALEVSEL_Msk                   (0x3U << RTC_CR_CALEVSEL_Pos)                  /**< (RTC_CR) Calendar Event Selection Mask */
#define RTC_CR_CALEVSEL(value)                (RTC_CR_CALEVSEL_Msk & ((value) << RTC_CR_CALEVSEL_Pos))
#define   RTC_CR_CALEVSEL_WEEK_Val            (0x0U)                                         /**< (RTC_CR) Week change (every Monday at time 00:00:00)  */
#define   RTC_CR_CALEVSEL_MONTH_Val           (0x1U)                                         /**< (RTC_CR) Month change (every 01 of each month at time 00:00:00)  */
#define   RTC_CR_CALEVSEL_YEAR_Val            (0x2U)                                         /**< (RTC_CR) Year change (every January 1 at time 00:00:00)  */
#define RTC_CR_CALEVSEL_WEEK                  (RTC_CR_CALEVSEL_WEEK_Val << RTC_CR_CALEVSEL_Pos)  /**< (RTC_CR) Week change (every Monday at time 00:00:00) Position  */
#define RTC_CR_CALEVSEL_MONTH                 (RTC_CR_CALEVSEL_MONTH_Val << RTC_CR_CALEVSEL_Pos)  /**< (RTC_CR) Month change (every 01 of each month at time 00:00:00) Position  */
#define RTC_CR_CALEVSEL_YEAR                  (RTC_CR_CALEVSEL_YEAR_Val << RTC_CR_CALEVSEL_Pos)  /**< (RTC_CR) Year change (every January 1 at time 00:00:00) Position  */
#define RTC_CR_Msk                            (0x00030303UL)                                 /**< (RTC_CR) Register Mask  */

/* -------- RTC_MR : (RTC Offset: 0x04) (R/W 32) Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t HRMOD:1;                   /**< bit:      0  12-/24-hour Mode                              */
    uint32_t PERSIAN:1;                 /**< bit:      1  PERSIAN Calendar                              */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t NEGPPM:1;                  /**< bit:      4  NEGative PPM Correction                       */
    uint32_t :3;                        /**< bit:   5..7  Reserved                                      */
    uint32_t CORRECTION:7;              /**< bit:  8..14  Slow Clock Correction                         */
    uint32_t HIGHPPM:1;                 /**< bit:     15  HIGH PPM Correction                           */
    uint32_t OUT0:3;                    /**< bit: 16..18  RTCOUT0 OutputSource Selection                */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t OUT1:3;                    /**< bit: 20..22  RTCOUT1 Output Source Selection               */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t THIGH:3;                   /**< bit: 24..26  High Duration of the Output Pulse             */
    uint32_t :1;                        /**< bit:     27  Reserved                                      */
    uint32_t TPERIOD:2;                 /**< bit: 28..29  Period of the Output Pulse                    */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __RTC_MR_bits_t;

#define RTC_MR_HRMOD_Pos                      (0)                                            /**< (RTC_MR) 12-/24-hour Mode Position */
#define RTC_MR_HRMOD_Msk                      (0x1U << RTC_MR_HRMOD_Pos)                     /**< (RTC_MR) 12-/24-hour Mode Mask */
#define RTC_MR_PERSIAN_Pos                    (1)                                            /**< (RTC_MR) PERSIAN Calendar Position */
#define RTC_MR_PERSIAN_Msk                    (0x1U << RTC_MR_PERSIAN_Pos)                   /**< (RTC_MR) PERSIAN Calendar Mask */
#define RTC_MR_NEGPPM_Pos                     (4)                                            /**< (RTC_MR) NEGative PPM Correction Position */
#define RTC_MR_NEGPPM_Msk                     (0x1U << RTC_MR_NEGPPM_Pos)                    /**< (RTC_MR) NEGative PPM Correction Mask */
#define RTC_MR_CORRECTION_Pos                 (8)                                            /**< (RTC_MR) Slow Clock Correction Position */
#define RTC_MR_CORRECTION_Msk                 (0x7FU << RTC_MR_CORRECTION_Pos)               /**< (RTC_MR) Slow Clock Correction Mask */
#define RTC_MR_CORRECTION(value)              (RTC_MR_CORRECTION_Msk & ((value) << RTC_MR_CORRECTION_Pos))
#define RTC_MR_HIGHPPM_Pos                    (15)                                           /**< (RTC_MR) HIGH PPM Correction Position */
#define RTC_MR_HIGHPPM_Msk                    (0x1U << RTC_MR_HIGHPPM_Pos)                   /**< (RTC_MR) HIGH PPM Correction Mask */
#define RTC_MR_OUT0_Pos                       (16)                                           /**< (RTC_MR) RTCOUT0 OutputSource Selection Position */
#define RTC_MR_OUT0_Msk                       (0x7U << RTC_MR_OUT0_Pos)                      /**< (RTC_MR) RTCOUT0 OutputSource Selection Mask */
#define RTC_MR_OUT0(value)                    (RTC_MR_OUT0_Msk & ((value) << RTC_MR_OUT0_Pos))
#define   RTC_MR_OUT0_NO_WAVE_Val             (0x0U)                                         /**< (RTC_MR) No waveform, stuck at '0'  */
#define   RTC_MR_OUT0_FREQ1HZ_Val             (0x1U)                                         /**< (RTC_MR) 1 Hz square wave  */
#define   RTC_MR_OUT0_FREQ32HZ_Val            (0x2U)                                         /**< (RTC_MR) 32 Hz square wave  */
#define   RTC_MR_OUT0_FREQ64HZ_Val            (0x3U)                                         /**< (RTC_MR) 64 Hz square wave  */
#define   RTC_MR_OUT0_FREQ512HZ_Val           (0x4U)                                         /**< (RTC_MR) 512 Hz square wave  */
#define   RTC_MR_OUT0_ALARM_TOGGLE_Val        (0x5U)                                         /**< (RTC_MR) Output toggles when alarm flag rises  */
#define   RTC_MR_OUT0_ALARM_FLAG_Val          (0x6U)                                         /**< (RTC_MR) Output is a copy of the alarm flag  */
#define   RTC_MR_OUT0_PROG_PULSE_Val          (0x7U)                                         /**< (RTC_MR) Duty cycle programmable pulse  */
#define RTC_MR_OUT0_NO_WAVE                   (RTC_MR_OUT0_NO_WAVE_Val << RTC_MR_OUT0_Pos)   /**< (RTC_MR) No waveform, stuck at '0' Position  */
#define RTC_MR_OUT0_FREQ1HZ                   (RTC_MR_OUT0_FREQ1HZ_Val << RTC_MR_OUT0_Pos)   /**< (RTC_MR) 1 Hz square wave Position  */
#define RTC_MR_OUT0_FREQ32HZ                  (RTC_MR_OUT0_FREQ32HZ_Val << RTC_MR_OUT0_Pos)  /**< (RTC_MR) 32 Hz square wave Position  */
#define RTC_MR_OUT0_FREQ64HZ                  (RTC_MR_OUT0_FREQ64HZ_Val << RTC_MR_OUT0_Pos)  /**< (RTC_MR) 64 Hz square wave Position  */
#define RTC_MR_OUT0_FREQ512HZ                 (RTC_MR_OUT0_FREQ512HZ_Val << RTC_MR_OUT0_Pos)  /**< (RTC_MR) 512 Hz square wave Position  */
#define RTC_MR_OUT0_ALARM_TOGGLE              (RTC_MR_OUT0_ALARM_TOGGLE_Val << RTC_MR_OUT0_Pos)  /**< (RTC_MR) Output toggles when alarm flag rises Position  */
#define RTC_MR_OUT0_ALARM_FLAG                (RTC_MR_OUT0_ALARM_FLAG_Val << RTC_MR_OUT0_Pos)  /**< (RTC_MR) Output is a copy of the alarm flag Position  */
#define RTC_MR_OUT0_PROG_PULSE                (RTC_MR_OUT0_PROG_PULSE_Val << RTC_MR_OUT0_Pos)  /**< (RTC_MR) Duty cycle programmable pulse Position  */
#define RTC_MR_OUT1_Pos                       (20)                                           /**< (RTC_MR) RTCOUT1 Output Source Selection Position */
#define RTC_MR_OUT1_Msk                       (0x7U << RTC_MR_OUT1_Pos)                      /**< (RTC_MR) RTCOUT1 Output Source Selection Mask */
#define RTC_MR_OUT1(value)                    (RTC_MR_OUT1_Msk & ((value) << RTC_MR_OUT1_Pos))
#define   RTC_MR_OUT1_NO_WAVE_Val             (0x0U)                                         /**< (RTC_MR) No waveform, stuck at '0'  */
#define   RTC_MR_OUT1_FREQ1HZ_Val             (0x1U)                                         /**< (RTC_MR) 1 Hz square wave  */
#define   RTC_MR_OUT1_FREQ32HZ_Val            (0x2U)                                         /**< (RTC_MR) 32 Hz square wave  */
#define   RTC_MR_OUT1_FREQ64HZ_Val            (0x3U)                                         /**< (RTC_MR) 64 Hz square wave  */
#define   RTC_MR_OUT1_FREQ512HZ_Val           (0x4U)                                         /**< (RTC_MR) 512 Hz square wave  */
#define   RTC_MR_OUT1_ALARM_TOGGLE_Val        (0x5U)                                         /**< (RTC_MR) Output toggles when alarm flag rises  */
#define   RTC_MR_OUT1_ALARM_FLAG_Val          (0x6U)                                         /**< (RTC_MR) Output is a copy of the alarm flag  */
#define   RTC_MR_OUT1_PROG_PULSE_Val          (0x7U)                                         /**< (RTC_MR) Duty cycle programmable pulse  */
#define RTC_MR_OUT1_NO_WAVE                   (RTC_MR_OUT1_NO_WAVE_Val << RTC_MR_OUT1_Pos)   /**< (RTC_MR) No waveform, stuck at '0' Position  */
#define RTC_MR_OUT1_FREQ1HZ                   (RTC_MR_OUT1_FREQ1HZ_Val << RTC_MR_OUT1_Pos)   /**< (RTC_MR) 1 Hz square wave Position  */
#define RTC_MR_OUT1_FREQ32HZ                  (RTC_MR_OUT1_FREQ32HZ_Val << RTC_MR_OUT1_Pos)  /**< (RTC_MR) 32 Hz square wave Position  */
#define RTC_MR_OUT1_FREQ64HZ                  (RTC_MR_OUT1_FREQ64HZ_Val << RTC_MR_OUT1_Pos)  /**< (RTC_MR) 64 Hz square wave Position  */
#define RTC_MR_OUT1_FREQ512HZ                 (RTC_MR_OUT1_FREQ512HZ_Val << RTC_MR_OUT1_Pos)  /**< (RTC_MR) 512 Hz square wave Position  */
#define RTC_MR_OUT1_ALARM_TOGGLE              (RTC_MR_OUT1_ALARM_TOGGLE_Val << RTC_MR_OUT1_Pos)  /**< (RTC_MR) Output toggles when alarm flag rises Position  */
#define RTC_MR_OUT1_ALARM_FLAG                (RTC_MR_OUT1_ALARM_FLAG_Val << RTC_MR_OUT1_Pos)  /**< (RTC_MR) Output is a copy of the alarm flag Position  */
#define RTC_MR_OUT1_PROG_PULSE                (RTC_MR_OUT1_PROG_PULSE_Val << RTC_MR_OUT1_Pos)  /**< (RTC_MR) Duty cycle programmable pulse Position  */
#define RTC_MR_THIGH_Pos                      (24)                                           /**< (RTC_MR) High Duration of the Output Pulse Position */
#define RTC_MR_THIGH_Msk                      (0x7U << RTC_MR_THIGH_Pos)                     /**< (RTC_MR) High Duration of the Output Pulse Mask */
#define RTC_MR_THIGH(value)                   (RTC_MR_THIGH_Msk & ((value) << RTC_MR_THIGH_Pos))
#define   RTC_MR_THIGH_H_31MS_Val             (0x0U)                                         /**< (RTC_MR) 31.2 ms  */
#define   RTC_MR_THIGH_H_16MS_Val             (0x1U)                                         /**< (RTC_MR) 15.6 ms  */
#define   RTC_MR_THIGH_H_4MS_Val              (0x2U)                                         /**< (RTC_MR) 3.91 ms  */
#define   RTC_MR_THIGH_H_976US_Val            (0x3U)                                         /**< (RTC_MR) 976 us  */
#define   RTC_MR_THIGH_H_488US_Val            (0x4U)                                         /**< (RTC_MR) 488 us  */
#define   RTC_MR_THIGH_H_122US_Val            (0x5U)                                         /**< (RTC_MR) 122 us  */
#define   RTC_MR_THIGH_H_30US_Val             (0x6U)                                         /**< (RTC_MR) 30.5 us  */
#define   RTC_MR_THIGH_H_15US_Val             (0x7U)                                         /**< (RTC_MR) 15.2 us  */
#define RTC_MR_THIGH_H_31MS                   (RTC_MR_THIGH_H_31MS_Val << RTC_MR_THIGH_Pos)  /**< (RTC_MR) 31.2 ms Position  */
#define RTC_MR_THIGH_H_16MS                   (RTC_MR_THIGH_H_16MS_Val << RTC_MR_THIGH_Pos)  /**< (RTC_MR) 15.6 ms Position  */
#define RTC_MR_THIGH_H_4MS                    (RTC_MR_THIGH_H_4MS_Val << RTC_MR_THIGH_Pos)   /**< (RTC_MR) 3.91 ms Position  */
#define RTC_MR_THIGH_H_976US                  (RTC_MR_THIGH_H_976US_Val << RTC_MR_THIGH_Pos)  /**< (RTC_MR) 976 us Position  */
#define RTC_MR_THIGH_H_488US                  (RTC_MR_THIGH_H_488US_Val << RTC_MR_THIGH_Pos)  /**< (RTC_MR) 488 us Position  */
#define RTC_MR_THIGH_H_122US                  (RTC_MR_THIGH_H_122US_Val << RTC_MR_THIGH_Pos)  /**< (RTC_MR) 122 us Position  */
#define RTC_MR_THIGH_H_30US                   (RTC_MR_THIGH_H_30US_Val << RTC_MR_THIGH_Pos)  /**< (RTC_MR) 30.5 us Position  */
#define RTC_MR_THIGH_H_15US                   (RTC_MR_THIGH_H_15US_Val << RTC_MR_THIGH_Pos)  /**< (RTC_MR) 15.2 us Position  */
#define RTC_MR_TPERIOD_Pos                    (28)                                           /**< (RTC_MR) Period of the Output Pulse Position */
#define RTC_MR_TPERIOD_Msk                    (0x3U << RTC_MR_TPERIOD_Pos)                   /**< (RTC_MR) Period of the Output Pulse Mask */
#define RTC_MR_TPERIOD(value)                 (RTC_MR_TPERIOD_Msk & ((value) << RTC_MR_TPERIOD_Pos))
#define   RTC_MR_TPERIOD_P_1S_Val             (0x0U)                                         /**< (RTC_MR) 1 second  */
#define   RTC_MR_TPERIOD_P_500MS_Val          (0x1U)                                         /**< (RTC_MR) 500 ms  */
#define   RTC_MR_TPERIOD_P_250MS_Val          (0x2U)                                         /**< (RTC_MR) 250 ms  */
#define   RTC_MR_TPERIOD_P_125MS_Val          (0x3U)                                         /**< (RTC_MR) 125 ms  */
#define RTC_MR_TPERIOD_P_1S                   (RTC_MR_TPERIOD_P_1S_Val << RTC_MR_TPERIOD_Pos)  /**< (RTC_MR) 1 second Position  */
#define RTC_MR_TPERIOD_P_500MS                (RTC_MR_TPERIOD_P_500MS_Val << RTC_MR_TPERIOD_Pos)  /**< (RTC_MR) 500 ms Position  */
#define RTC_MR_TPERIOD_P_250MS                (RTC_MR_TPERIOD_P_250MS_Val << RTC_MR_TPERIOD_Pos)  /**< (RTC_MR) 250 ms Position  */
#define RTC_MR_TPERIOD_P_125MS                (RTC_MR_TPERIOD_P_125MS_Val << RTC_MR_TPERIOD_Pos)  /**< (RTC_MR) 125 ms Position  */
#define RTC_MR_Msk                            (0x3777FF13UL)                                 /**< (RTC_MR) Register Mask  */

/* -------- RTC_TIMR : (RTC Offset: 0x08) (R/W 32) Time Register -------- */

typedef union
{
  struct
  {
    uint32_t SEC:7;                     /**< bit:   0..6  Current Second                                */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t MIN:7;                     /**< bit:  8..14  Current Minute                                */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t HOUR:6;                    /**< bit: 16..21  Current Hour                                  */
    uint32_t AMPM:1;                    /**< bit:     22  Ante Meridiem Post Meridiem Indicator         */
    uint32_t :9;                        /**< bit: 23..31  Reserved                                      */
  };
  uint32_t w;
} __RTC_TIMR_bits_t;

#define RTC_TIMR_SEC_Pos                      (0)                                            /**< (RTC_TIMR) Current Second Position */
#define RTC_TIMR_SEC_Msk                      (0x7FU << RTC_TIMR_SEC_Pos)                    /**< (RTC_TIMR) Current Second Mask */
#define RTC_TIMR_SEC(value)                   (RTC_TIMR_SEC_Msk & ((value) << RTC_TIMR_SEC_Pos))
#define RTC_TIMR_MIN_Pos                      (8)                                            /**< (RTC_TIMR) Current Minute Position */
#define RTC_TIMR_MIN_Msk                      (0x7FU << RTC_TIMR_MIN_Pos)                    /**< (RTC_TIMR) Current Minute Mask */
#define RTC_TIMR_MIN(value)                   (RTC_TIMR_MIN_Msk & ((value) << RTC_TIMR_MIN_Pos))
#define RTC_TIMR_HOUR_Pos                     (16)                                           /**< (RTC_TIMR) Current Hour Position */
#define RTC_TIMR_HOUR_Msk                     (0x3FU << RTC_TIMR_HOUR_Pos)                   /**< (RTC_TIMR) Current Hour Mask */
#define RTC_TIMR_HOUR(value)                  (RTC_TIMR_HOUR_Msk & ((value) << RTC_TIMR_HOUR_Pos))
#define RTC_TIMR_AMPM_Pos                     (22)                                           /**< (RTC_TIMR) Ante Meridiem Post Meridiem Indicator Position */
#define RTC_TIMR_AMPM_Msk                     (0x1U << RTC_TIMR_AMPM_Pos)                    /**< (RTC_TIMR) Ante Meridiem Post Meridiem Indicator Mask */
#define RTC_TIMR_Msk                          (0x007F7F7FUL)                                 /**< (RTC_TIMR) Register Mask  */

/* -------- RTC_CALR : (RTC Offset: 0x0c) (R/W 32) Calendar Register -------- */

typedef union
{
  struct
  {
    uint32_t CENT:7;                    /**< bit:   0..6  Current Century                               */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t YEAR:8;                    /**< bit:  8..15  Current Year                                  */
    uint32_t MONTH:5;                   /**< bit: 16..20  Current Month                                 */
    uint32_t DAY:3;                     /**< bit: 21..23  Current Day in Current Week                   */
    uint32_t DATE:6;                    /**< bit: 24..29  Current Day in Current Month                  */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __RTC_CALR_bits_t;

