zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/rtc.h
#define RTC_CALR_CENT_Pos                     (0)                                            /**< (RTC_CALR) Current Century Position */
#define RTC_CALR_CENT_Msk                     (0x7FU << RTC_CALR_CENT_Pos)                   /**< (RTC_CALR) Current Century Mask */
#define RTC_CALR_CENT(value)                  (RTC_CALR_CENT_Msk & ((value) << RTC_CALR_CENT_Pos))
#define RTC_CALR_YEAR_Pos                     (8)                                            /**< (RTC_CALR) Current Year Position */
#define RTC_CALR_YEAR_Msk                     (0xFFU << RTC_CALR_YEAR_Pos)                   /**< (RTC_CALR) Current Year Mask */
#define RTC_CALR_YEAR(value)                  (RTC_CALR_YEAR_Msk & ((value) << RTC_CALR_YEAR_Pos))
#define RTC_CALR_MONTH_Pos                    (16)                                           /**< (RTC_CALR) Current Month Position */
#define RTC_CALR_MONTH_Msk                    (0x1FU << RTC_CALR_MONTH_Pos)                  /**< (RTC_CALR) Current Month Mask */
#define RTC_CALR_MONTH(value)                 (RTC_CALR_MONTH_Msk & ((value) << RTC_CALR_MONTH_Pos))
#define RTC_CALR_DAY_Pos                      (21)                                           /**< (RTC_CALR) Current Day in Current Week Position */
#define RTC_CALR_DAY_Msk                      (0x7U << RTC_CALR_DAY_Pos)                     /**< (RTC_CALR) Current Day in Current Week Mask */
#define RTC_CALR_DAY(value)                   (RTC_CALR_DAY_Msk & ((value) << RTC_CALR_DAY_Pos))
#define RTC_CALR_DATE_Pos                     (24)                                           /**< (RTC_CALR) Current Day in Current Month Position */
#define RTC_CALR_DATE_Msk                     (0x3FU << RTC_CALR_DATE_Pos)                   /**< (RTC_CALR) Current Day in Current Month Mask */
#define RTC_CALR_DATE(value)                  (RTC_CALR_DATE_Msk & ((value) << RTC_CALR_DATE_Pos))
#define RTC_CALR_Msk                          (0x3FFFFF7FUL)                                 /**< (RTC_CALR) Register Mask  */

/* -------- RTC_TIMALR : (RTC Offset: 0x10) (R/W 32) Time Alarm Register -------- */

typedef union
{
  struct
  {
    uint32_t SEC:7;                     /**< bit:   0..6  Second Alarm                                  */
    uint32_t SECEN:1;                   /**< bit:      7  Second Alarm Enable                           */
    uint32_t MIN:7;                     /**< bit:  8..14  Minute Alarm                                  */
    uint32_t MINEN:1;                   /**< bit:     15  Minute Alarm Enable                           */
    uint32_t HOUR:6;                    /**< bit: 16..21  Hour Alarm                                    */
    uint32_t AMPM:1;                    /**< bit:     22  AM/PM Indicator                               */
    uint32_t HOUREN:1;                  /**< bit:     23  Hour Alarm Enable                             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __RTC_TIMALR_bits_t;

#define RTC_TIMALR_SEC_Pos                    (0)                                            /**< (RTC_TIMALR) Second Alarm Position */
#define RTC_TIMALR_SEC_Msk                    (0x7FU << RTC_TIMALR_SEC_Pos)                  /**< (RTC_TIMALR) Second Alarm Mask */
#define RTC_TIMALR_SEC(value)                 (RTC_TIMALR_SEC_Msk & ((value) << RTC_TIMALR_SEC_Pos))
#define RTC_TIMALR_SECEN_Pos                  (7)                                            /**< (RTC_TIMALR) Second Alarm Enable Position */
#define RTC_TIMALR_SECEN_Msk                  (0x1U << RTC_TIMALR_SECEN_Pos)                 /**< (RTC_TIMALR) Second Alarm Enable Mask */
#define RTC_TIMALR_MIN_Pos                    (8)                                            /**< (RTC_TIMALR) Minute Alarm Position */
#define RTC_TIMALR_MIN_Msk                    (0x7FU << RTC_TIMALR_MIN_Pos)                  /**< (RTC_TIMALR) Minute Alarm Mask */
#define RTC_TIMALR_MIN(value)                 (RTC_TIMALR_MIN_Msk & ((value) << RTC_TIMALR_MIN_Pos))
#define RTC_TIMALR_MINEN_Pos                  (15)                                           /**< (RTC_TIMALR) Minute Alarm Enable Position */
#define RTC_TIMALR_MINEN_Msk                  (0x1U << RTC_TIMALR_MINEN_Pos)                 /**< (RTC_TIMALR) Minute Alarm Enable Mask */
#define RTC_TIMALR_HOUR_Pos                   (16)                                           /**< (RTC_TIMALR) Hour Alarm Position */
#define RTC_TIMALR_HOUR_Msk                   (0x3FU << RTC_TIMALR_HOUR_Pos)                 /**< (RTC_TIMALR) Hour Alarm Mask */
#define RTC_TIMALR_HOUR(value)                (RTC_TIMALR_HOUR_Msk & ((value) << RTC_TIMALR_HOUR_Pos))
#define RTC_TIMALR_AMPM_Pos                   (22)                                           /**< (RTC_TIMALR) AM/PM Indicator Position */
#define RTC_TIMALR_AMPM_Msk                   (0x1U << RTC_TIMALR_AMPM_Pos)                  /**< (RTC_TIMALR) AM/PM Indicator Mask */
#define RTC_TIMALR_HOUREN_Pos                 (23)                                           /**< (RTC_TIMALR) Hour Alarm Enable Position */
#define RTC_TIMALR_HOUREN_Msk                 (0x1U << RTC_TIMALR_HOUREN_Pos)                /**< (RTC_TIMALR) Hour Alarm Enable Mask */
#define RTC_TIMALR_Msk                        (0x00FFFFFFUL)                                 /**< (RTC_TIMALR) Register Mask  */

/* -------- RTC_CALALR : (RTC Offset: 0x14) (R/W 32) Calendar Alarm Register -------- */

typedef union
{
  struct
  {
    uint32_t :16;                       /**< bit:  0..15  Reserved                                      */
    uint32_t MONTH:5;                   /**< bit: 16..20  Month Alarm                                   */
    uint32_t :2;                        /**< bit: 21..22  Reserved                                      */
    uint32_t MTHEN:1;                   /**< bit:     23  Month Alarm Enable                            */
    uint32_t DATE:6;                    /**< bit: 24..29  Date Alarm                                    */
    uint32_t :1;                        /**< bit:     30  Reserved                                      */
    uint32_t DATEEN:1;                  /**< bit:     31  Date Alarm Enable                             */
  };
  uint32_t w;
} __RTC_CALALR_bits_t;

#define RTC_CALALR_MONTH_Pos                  (16)                                           /**< (RTC_CALALR) Month Alarm Position */
#define RTC_CALALR_MONTH_Msk                  (0x1FU << RTC_CALALR_MONTH_Pos)                /**< (RTC_CALALR) Month Alarm Mask */
#define RTC_CALALR_MONTH(value)               (RTC_CALALR_MONTH_Msk & ((value) << RTC_CALALR_MONTH_Pos))
#define RTC_CALALR_MTHEN_Pos                  (23)                                           /**< (RTC_CALALR) Month Alarm Enable Position */
#define RTC_CALALR_MTHEN_Msk                  (0x1U << RTC_CALALR_MTHEN_Pos)                 /**< (RTC_CALALR) Month Alarm Enable Mask */
#define RTC_CALALR_DATE_Pos                   (24)                                           /**< (RTC_CALALR) Date Alarm Position */
#define RTC_CALALR_DATE_Msk                   (0x3FU << RTC_CALALR_DATE_Pos)                 /**< (RTC_CALALR) Date Alarm Mask */
#define RTC_CALALR_DATE(value)                (RTC_CALALR_DATE_Msk & ((value) << RTC_CALALR_DATE_Pos))
#define RTC_CALALR_DATEEN_Pos                 (31)                                           /**< (RTC_CALALR) Date Alarm Enable Position */
#define RTC_CALALR_DATEEN_Msk                 (0x1U << RTC_CALALR_DATEEN_Pos)                /**< (RTC_CALALR) Date Alarm Enable Mask */
#define RTC_CALALR_Msk                        (0xBF9F0000UL)                                 /**< (RTC_CALALR) Register Mask  */

