zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/rtc.h
#define RTC_SCCR_ACKCLR_Pos                   (0)                                            /**< (RTC_SCCR) Acknowledge Clear Position */
#define RTC_SCCR_ACKCLR_Msk                   (0x1U << RTC_SCCR_ACKCLR_Pos)                  /**< (RTC_SCCR) Acknowledge Clear Mask */
#define RTC_SCCR_ALRCLR_Pos                   (1)                                            /**< (RTC_SCCR) Alarm Clear Position */
#define RTC_SCCR_ALRCLR_Msk                   (0x1U << RTC_SCCR_ALRCLR_Pos)                  /**< (RTC_SCCR) Alarm Clear Mask */
#define RTC_SCCR_SECCLR_Pos                   (2)                                            /**< (RTC_SCCR) Second Clear Position */
#define RTC_SCCR_SECCLR_Msk                   (0x1U << RTC_SCCR_SECCLR_Pos)                  /**< (RTC_SCCR) Second Clear Mask */
#define RTC_SCCR_TIMCLR_Pos                   (3)                                            /**< (RTC_SCCR) Time Clear Position */
#define RTC_SCCR_TIMCLR_Msk                   (0x1U << RTC_SCCR_TIMCLR_Pos)                  /**< (RTC_SCCR) Time Clear Mask */
#define RTC_SCCR_CALCLR_Pos                   (4)                                            /**< (RTC_SCCR) Calendar Clear Position */
#define RTC_SCCR_CALCLR_Msk                   (0x1U << RTC_SCCR_CALCLR_Pos)                  /**< (RTC_SCCR) Calendar Clear Mask */
#define RTC_SCCR_TDERRCLR_Pos                 (5)                                            /**< (RTC_SCCR) Time and/or Date Free Running Error Clear Position */
#define RTC_SCCR_TDERRCLR_Msk                 (0x1U << RTC_SCCR_TDERRCLR_Pos)                /**< (RTC_SCCR) Time and/or Date Free Running Error Clear Mask */
#define RTC_SCCR_Msk                          (0x0000003FUL)                                 /**< (RTC_SCCR) Register Mask  */

/* -------- RTC_IER : (RTC Offset: 0x20) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t ACKEN:1;                   /**< bit:      0  Acknowledge Update Interrupt Enable           */
    uint32_t ALREN:1;                   /**< bit:      1  Alarm Interrupt Enable                        */
    uint32_t SECEN:1;                   /**< bit:      2  Second Event Interrupt Enable                 */
    uint32_t TIMEN:1;                   /**< bit:      3  Time Event Interrupt Enable                   */
    uint32_t CALEN:1;                   /**< bit:      4  Calendar Event Interrupt Enable               */
    uint32_t TDERREN:1;                 /**< bit:      5  Time and/or Date Error Interrupt Enable       */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __RTC_IER_bits_t;

#define RTC_IER_ACKEN_Pos                     (0)                                            /**< (RTC_IER) Acknowledge Update Interrupt Enable Position */
#define RTC_IER_ACKEN_Msk                     (0x1U << RTC_IER_ACKEN_Pos)                    /**< (RTC_IER) Acknowledge Update Interrupt Enable Mask */
#define RTC_IER_ALREN_Pos                     (1)                                            /**< (RTC_IER) Alarm Interrupt Enable Position */
#define RTC_IER_ALREN_Msk                     (0x1U << RTC_IER_ALREN_Pos)                    /**< (RTC_IER) Alarm Interrupt Enable Mask */
#define RTC_IER_SECEN_Pos                     (2)                                            /**< (RTC_IER) Second Event Interrupt Enable Position */
#define RTC_IER_SECEN_Msk                     (0x1U << RTC_IER_SECEN_Pos)                    /**< (RTC_IER) Second Event Interrupt Enable Mask */
#define RTC_IER_TIMEN_Pos                     (3)                                            /**< (RTC_IER) Time Event Interrupt Enable Position */
#define RTC_IER_TIMEN_Msk                     (0x1U << RTC_IER_TIMEN_Pos)                    /**< (RTC_IER) Time Event Interrupt Enable Mask */
#define RTC_IER_CALEN_Pos                     (4)                                            /**< (RTC_IER) Calendar Event Interrupt Enable Position */
#define RTC_IER_CALEN_Msk                     (0x1U << RTC_IER_CALEN_Pos)                    /**< (RTC_IER) Calendar Event Interrupt Enable Mask */
#define RTC_IER_TDERREN_Pos                   (5)                                            /**< (RTC_IER) Time and/or Date Error Interrupt Enable Position */
#define RTC_IER_TDERREN_Msk                   (0x1U << RTC_IER_TDERREN_Pos)                  /**< (RTC_IER) Time and/or Date Error Interrupt Enable Mask */
#define RTC_IER_Msk                           (0x0000003FUL)                                 /**< (RTC_IER) Register Mask  */

/* -------- RTC_IDR : (RTC Offset: 0x24) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t ACKDIS:1;                  /**< bit:      0  Acknowledge Update Interrupt Disable          */
    uint32_t ALRDIS:1;                  /**< bit:      1  Alarm Interrupt Disable                       */
    uint32_t SECDIS:1;                  /**< bit:      2  Second Event Interrupt Disable                */
    uint32_t TIMDIS:1;                  /**< bit:      3  Time Event Interrupt Disable                  */
    uint32_t CALDIS:1;                  /**< bit:      4  Calendar Event Interrupt Disable              */
    uint32_t TDERRDIS:1;                /**< bit:      5  Time and/or Date Error Interrupt Disable      */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __RTC_IDR_bits_t;

#define RTC_IDR_ACKDIS_Pos                    (0)                                            /**< (RTC_IDR) Acknowledge Update Interrupt Disable Position */
#define RTC_IDR_ACKDIS_Msk                    (0x1U << RTC_IDR_ACKDIS_Pos)                   /**< (RTC_IDR) Acknowledge Update Interrupt Disable Mask */
#define RTC_IDR_ALRDIS_Pos                    (1)                                            /**< (RTC_IDR) Alarm Interrupt Disable Position */
#define RTC_IDR_ALRDIS_Msk                    (0x1U << RTC_IDR_ALRDIS_Pos)                   /**< (RTC_IDR) Alarm Interrupt Disable Mask */
#define RTC_IDR_SECDIS_Pos                    (2)                                            /**< (RTC_IDR) Second Event Interrupt Disable Position */
#define RTC_IDR_SECDIS_Msk                    (0x1U << RTC_IDR_SECDIS_Pos)                   /**< (RTC_IDR) Second Event Interrupt Disable Mask */
#define RTC_IDR_TIMDIS_Pos                    (3)                                            /**< (RTC_IDR) Time Event Interrupt Disable Position */
#define RTC_IDR_TIMDIS_Msk                    (0x1U << RTC_IDR_TIMDIS_Pos)                   /**< (RTC_IDR) Time Event Interrupt Disable Mask */
#define RTC_IDR_CALDIS_Pos                    (4)                                            /**< (RTC_IDR) Calendar Event Interrupt Disable Position */
#define RTC_IDR_CALDIS_Msk                    (0x1U << RTC_IDR_CALDIS_Pos)                   /**< (RTC_IDR) Calendar Event Interrupt Disable Mask */
#define RTC_IDR_TDERRDIS_Pos                  (5)                                            /**< (RTC_IDR) Time and/or Date Error Interrupt Disable Position */
#define RTC_IDR_TDERRDIS_Msk                  (0x1U << RTC_IDR_TDERRDIS_Pos)                 /**< (RTC_IDR) Time and/or Date Error Interrupt Disable Mask */
#define RTC_IDR_Msk                           (0x0000003FUL)                                 /**< (RTC_IDR) Register Mask  */

/* -------- RTC_IMR : (RTC Offset: 0x28) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t ACK:1;                     /**< bit:      0  Acknowledge Update Interrupt Mask             */
    uint32_t ALR:1;                     /**< bit:      1  Alarm Interrupt Mask                          */
    uint32_t SEC:1;                     /**< bit:      2  Second Event Interrupt Mask                   */
    uint32_t TIM:1;                     /**< bit:      3  Time Event Interrupt Mask                     */
    uint32_t CAL:1;                     /**< bit:      4  Calendar Event Interrupt Mask                 */
    uint32_t TDERR:1;                   /**< bit:      5  Time and/or Date Error Mask                   */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __RTC_IMR_bits_t;

#define RTC_IMR_ACK_Pos                       (0)                                            /**< (RTC_IMR) Acknowledge Update Interrupt Mask Position */
#define RTC_IMR_ACK_Msk                       (0x1U << RTC_IMR_ACK_Pos)                      /**< (RTC_IMR) Acknowledge Update Interrupt Mask Mask */
#define RTC_IMR_ALR_Pos                       (1)                                            /**< (RTC_IMR) Alarm Interrupt Mask Position */
#define RTC_IMR_ALR_Msk                       (0x1U << RTC_IMR_ALR_Pos)                      /**< (RTC_IMR) Alarm Interrupt Mask Mask */
#define RTC_IMR_SEC_Pos                       (2)                                            /**< (RTC_IMR) Second Event Interrupt Mask Position */
#define RTC_IMR_SEC_Msk                       (0x1U << RTC_IMR_SEC_Pos)                      /**< (RTC_IMR) Second Event Interrupt Mask Mask */
#define RTC_IMR_TIM_Pos                       (3)                                            /**< (RTC_IMR) Time Event Interrupt Mask Position */
#define RTC_IMR_TIM_Msk                       (0x1U << RTC_IMR_TIM_Pos)                      /**< (RTC_IMR) Time Event Interrupt Mask Mask */
#define RTC_IMR_CAL_Pos                       (4)                                            /**< (RTC_IMR) Calendar Event Interrupt Mask Position */
#define RTC_IMR_CAL_Msk                       (0x1U << RTC_IMR_CAL_Pos)                      /**< (RTC_IMR) Calendar Event Interrupt Mask Mask */
#define RTC_IMR_TDERR_Pos                     (5)                                            /**< (RTC_IMR) Time and/or Date Error Mask Position */
#define RTC_IMR_TDERR_Msk                     (0x1U << RTC_IMR_TDERR_Pos)                    /**< (RTC_IMR) Time and/or Date Error Mask Mask */
#define RTC_IMR_Msk                           (0x0000003FUL)                                 /**< (RTC_IMR) Register Mask  */

/* -------- RTC_VER : (RTC Offset: 0x2c) (R/ 32) Valid Entry Register -------- */

typedef union
{
  struct
  {
    uint32_t NVTIM:1;                   /**< bit:      0  Non-valid Time                                */
    uint32_t NVCAL:1;                   /**< bit:      1  Non-valid Calendar                            */
    uint32_t NVTIMALR:1;                /**< bit:      2  Non-valid Time Alarm                          */
    uint32_t NVCALALR:1;                /**< bit:      3  Non-valid Calendar Alarm                      */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __RTC_VER_bits_t;

#define RTC_VER_NVTIM_Pos                     (0)                                            /**< (RTC_VER) Non-valid Time Position */
#define RTC_VER_NVTIM_Msk                     (0x1U << RTC_VER_NVTIM_Pos)                    /**< (RTC_VER) Non-valid Time Mask */
#define RTC_VER_NVCAL_Pos                     (1)                                            /**< (RTC_VER) Non-valid Calendar Position */
#define RTC_VER_NVCAL_Msk                     (0x1U << RTC_VER_NVCAL_Pos)                    /**< (RTC_VER) Non-valid Calendar Mask */
#define RTC_VER_NVTIMALR_Pos                  (2)                                            /**< (RTC_VER) Non-valid Time Alarm Position */
#define RTC_VER_NVTIMALR_Msk                  (0x1U << RTC_VER_NVTIMALR_Pos)                 /**< (RTC_VER) Non-valid Time Alarm Mask */
#define RTC_VER_NVCALALR_Pos                  (3)                                            /**< (RTC_VER) Non-valid Calendar Alarm Position */
#define RTC_VER_NVCALALR_Msk                  (0x1U << RTC_VER_NVCALALR_Pos)                 /**< (RTC_VER) Non-valid Calendar Alarm Mask */
#define RTC_VER_Msk                           (0x0000000FUL)                                 /**< (RTC_VER) Register Mask  */

/** \brief RTC register offsets definitions */
#define RTC_CR_OFFSET                (0x00)         /**< (RTC_CR) Control Register Offset */
#define RTC_MR_OFFSET                (0x04)         /**< (RTC_MR) Mode Register Offset */
#define RTC_TIMR_OFFSET              (0x08)         /**< (RTC_TIMR) Time Register Offset */
#define RTC_CALR_OFFSET              (0x0C)         /**< (RTC_CALR) Calendar Register Offset */
#define RTC_TIMALR_OFFSET            (0x10)         /**< (RTC_TIMALR) Time Alarm Register Offset */
#define RTC_CALALR_OFFSET            (0x14)         /**< (RTC_CALALR) Calendar Alarm Register Offset */
#define RTC_SR_OFFSET                (0x18)         /**< (RTC_SR) Status Register Offset */
#define RTC_SCCR_OFFSET              (0x1C)         /**< (RTC_SCCR) Status Clear Command Register Offset */
#define RTC_IER_OFFSET               (0x20)         /**< (RTC_IER) Interrupt Enable Register Offset */
#define RTC_IDR_OFFSET               (0x24)         /**< (RTC_IDR) Interrupt Disable Register Offset */
#define RTC_IMR_OFFSET               (0x28)         /**< (RTC_IMR) Interrupt Mask Register Offset */
#define RTC_VER_OFFSET               (0x2C)         /**< (RTC_VER) Valid Entry Register Offset */

/** \brief RTC register API structure */
typedef struct
{
  __IO  __RTC_CR_bits_t                RTC_CR;        /**< Offset: 0x00 (R/W  32) Control Register */
  __IO  __RTC_MR_bits_t                RTC_MR;        /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  __RTC_TIMR_bits_t              RTC_TIMR;      /**< Offset: 0x08 (R/W  32) Time Register */
  __IO  __RTC_CALR_bits_t              RTC_CALR;      /**< Offset: 0x0C (R/W  32) Calendar Register */
  __IO  __RTC_TIMALR_bits_t            RTC_TIMALR;    /**< Offset: 0x10 (R/W  32) Time Alarm Register */
  __IO  __RTC_CALALR_bits_t            RTC_CALALR;    /**< Offset: 0x14 (R/W  32) Calendar Alarm Register */
  __I   __RTC_SR_bits_t                RTC_SR;        /**< Offset: 0x18 (R/   32) Status Register */
  __O   __RTC_SCCR_bits_t              RTC_SCCR;      /**< Offset: 0x1C ( /W  32) Status Clear Command Register */
  __O   __RTC_IER_bits_t               RTC_IER;       /**< Offset: 0x20 ( /W  32) Interrupt Enable Register */
  __O   __RTC_IDR_bits_t               RTC_IDR;       /**< Offset: 0x24 ( /W  32) Interrupt Disable Register */
  __I   __RTC_IMR_bits_t               RTC_IMR;       /**< Offset: 0x28 (R/   32) Interrupt Mask Register */
  __I   __RTC_VER_bits_t               RTC_VER;       /**< Offset: 0x2C (R/   32) Valid Entry Register */
} rtc_registers_t;
/** @}  end of Real-time Clock */

#endif /* _PIC32CZ_CA70_RTC_COMPONENT_H_ */
